app/controllers/customers_controller.rb

  def show
    @previous_orders = @customer.orders.chronological
    @suggestions = Item.where(category: @customer.orders.first.order_items.first.item.category).first(3)
---
SELECT  "orders".* FROM "orders" WHERE "orders"."customer_id" = ? ORDER BY "orders"."id" ASC LIMIT ?
SELECT  "items".* FROM "items" WHERE "items"."category" = ? ORDER BY "items"."id" ASC LIMIT ?