app/models/item.rb

SELECT "items".* FROM "items" WHERE "items"."active" = ?
SELECT "order_items".* FROM "order_items"
---
  def self.most_sold
    result = Hash.new

    Item.active.each do |item|
      result[item] = 0
    end

    OrderItem.all.each do |oi|

SELECT "items".* FROM "items" WHERE "items"."category" = ?
---
  def self.to_ship(category)
    res = []

    this = Item.for_category(category)

    this.each do |item|